//**********************************************************************//
//                            _ooOoo_                                   //
//                           o8888888o                                  //	
//                           88" . "88                                  //
//                           (| -_- |)                                  //
//                            O\ = /O                                   //
//                        ____/`---'\____                               //
//                      .   ' \\| |// `.                                //
//                       / \\||| : |||// \                              //
//                     / _||||| -:- |||||- \                            //
//                       | | \\\ - /// | |                              //
//                     | \_| ''\---/'' | |                              //
//                      \ .-\__ `-` ___/-. /                            //
//                   ___`. .' /--.--\ `. . __                           //
//                ."" '< `.___\_<|>_/___.' >'"".                        //
//               | | : `- \`.;`\ _ /`;.`/ - ` : | |                     //
//                 \ \ `-. \_ __\ /__ _/ .-` / /                        //
//         ======`-.____`-.___\_____/___.-`____.-'======                //
//                            `=---='                                   //
//                                                                      //
//         .............................................                //
//                  佛祖保佑             永无BUG                        //
//          佛曰:                                                       //
//                  写字楼里写字间，写字间里程序员；                    //
//                  程序人员写程序，又拿程序换酒钱。                    //  
//                  酒醒只在网上坐，酒醉还来网下眠；                    //
//                  酒醉酒醒日复日，网上网下年复年。                    //
//                  但愿老死电脑间，不愿鞠躬老板前；                    //
//                  奔驰宝马贵者趣，公交自行程序员。                    //
//                  别人笑我忒疯癫，我笑自己命太贱；                    //
//                  不见满街漂亮妹，哪个归得程序员？                    //
//                                                                      //
//**********************************************************************//


// debug in win10-VS2017 & MI6(MIUI)


#include<iostream>
#include"JumpVision.h"

int main() {
	double jump_ratio = 1.390;
	double input;
	std::cout << "input ratio (or press enter using default:1.390):" << std::endl;
	std::cin>>std::noskipws >> input;
	if (input > 0) {
		jump_ratio = input;
	}
	std::cout << "starting" << std::endl;
	for (int i = 0; i < 500; ++i) {
		if (!Process(jump_ratio)) {
			break;
		}
	}
	std::cout << "end game" << std::endl;
	system("pause");
	return 0;
}